Revit 2020 API
FormatOptions.GetValidUnitSymbols Method (DisplayUnitType)
 Gets all valid unit symbols for a given display unit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static IList<UnitSymbolType> GetValidUnitSymbols(
	DisplayUnitType displayUnit
)
Visual Basic
Public Shared Function GetValidUnitSymbols ( _
	displayUnit As DisplayUnitType _
) As IList(Of UnitSymbolType)
Visual C++
public:
static IList<UnitSymbolType>^ GetValidUnitSymbols(
	DisplayUnitType displayUnit
)
Parameters
displayUnit
Type: Autodesk.Revit.DB.DisplayUnitType
 The display unit.
Return Value
 The valid unit symbols.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  displayUnit is an invalid display unit. See UnitUtils.IsValidDisplayUnit(DisplayUnitType) and UnitUtils.GetValidDisplayUnits().
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
FormatOptions Class
GetValidUnitSymbols Overload
Autodesk.Revit.DB Namespace